[
    {
        "role":"Senior Devops",
        "branch": "logistic, freelance  -  Berlin, Germany",
        "company":"SevenSenders GmbH",
        "summary":"I help the infrastructure team to transform himself to get the possibility to support all infrastructure tasks and complete infrastructure migration. Also, I have refactored the same components of infrastructure like terraform modules and helm charts for fixing critical problems. I design and implement infrastructure support plans with maintenance events and scheduling of change.",
        "range":"Juli 2022-December 2022",
        "stack": [
            "Multi account AWS cloud",
            "ArgoCD",
            "Helm",
            "Terraform",
            "Kubernetes",
            "Docker",
            "Java",
            "Spring-framework",
            "Kafka",
            "MongoDB",
            "Mysql"
        ]
    },
    {
        "role":"Site Reliability Engineer",
        "branch": "Cloud computing, freelance  -  Berlin, Germany",
        "company":"Ionos GmbH",
        "summary":"The main activity of the project was related to refactoring infrastructure as a code for a set of applications. Key features were implemented in project gitops deployment with ArgoCD as the main orchestration tool.  Projects include multi-cluster and multi-data-center and multi-regional decentralization concepts that realize high availability, high readability, and observability.",
        "range":"August 2021-June 2022",
        "stack": [
            "Rancher",
            "cepf",
            "MetalLB",
            "Kubernetes", 
            "terraform", 
            "Helm", 
            "ArgoCD", 
            "Traefik",  
            "Gitlab CI-CD", 
            "Github action", 
            "Docker", 
            "Java", 
            "microservice architecture"
        ]
    },
    {
        "role":"Senior Devops",
        "branch": "logistic, freelance  -  Berlin, Germany",
        "company":"SevenSenders GmbH",
        "summary":"I have rebuilt and migrated complex legacy multi-account AWS cloud infrastructure with a set of different development patterns to single and reliable infrastructure on top of AWS cloud. We have described all infrastructure resources in Terraform, Helm, and Docker declarative Infrastructure as a code. Together with Infrastructure, we rebuild development workflow to get fully autonomic continuous integration and continuous deployment process. We have to implement GitOps with ArgoCD and Gitlab-CI for infrastructure and application automatic delivery. I have a delivery large impact on hardening corporate security, data flow, and data processing. This improvement decreases the complexity of existing infrastructure and as a result cost of ownership. In parallel, I have work with the Corporate DataLake project that have got concrete specification and development sprint. Kafka, AWS Glue, MongoDB, and Snowflake will be the main components for this ambition Data lake project.",
        "range":"November 2020-Juli 2021",
        "stack": [
            "Multi account AWS cloud",
            "ArgoCD",
            "Helm",
            "Terraform",
            "Kubernetes",
            "Docker",
            "Java",
            "Spring-framework",
            "Kafka",
            "MongoDB",
            "Mysql"
        ]
    },
    {
        "role":"Development and IT Operations Engineer, Team Lead",
        "branch": "real estate, permanent contract  -  Berlin, Germany",
        "company":"McMakler GmbH",
        "summary":"For three years I have built IT infrastructure that takes the possibility to grow the company from proof of content to corporate size Enterprise with over 1000 employers. IT infrastructure was migrated from a bare-metal monolithic application and primitive developer workflows, to multi-cloud microservices infrastructure with fully automatic infrastructure provisioning, builds testing, and deployments from change request to production. For getting these results I have built Infrastructure as a Code, fully automated CI/CD pipelines, comtrained DevOps Team in an Agile workflow, build networks, hardened secure policies and access rules, and developed several microservice applications. I have used GitLab CI, Terraform, Kubernetes, Ansible, Python, and Golang in this project. Data have operated by MongoDB cluster that builds on the promise and Atlas MongoDB as SaaS that defined in Terraform state. Event processing realized with Cadence from Uber and Apache Cassandra cluster as a data back-end. Process and data workflow realized with Airflow and Tableau as visualization and data representation services. All systems logs have collected and processed at EFK stacks. All metrics and alerting were operated with Google Stackdriver.",
        "range":"June 2017-September 2020",
        "stack": [
            "GCP",
            "ArgoCD",
            "Gitlab CI/CD",
            "Terraform",
            "Kubernetes",
            "Docker",
            "PHP",
            "GrafQL",
            "PosrgreSQL",
            "MLOPS",
            "MongoDB",
            "ELK",
            "InfluxDB"
        ]
    },
    {
        "role":"Senior DevOps",
        "branch": "automotive, permanent contract  -  Berlin, Germany",
        "company":"Rocket Data International GmbH",
        "summary":"The main challenge was the development and building infrastructure for the 3D CAD rendering API application. In parallel, I have realized several projects in the data processing. I was developed to process several workflows for several business departments of our customers. I have realized business process management workflow with JIRA, and Confluent collaboration with integration to several corporate directory services. I have to implement authentification based on Microsoft Active directory with SSO for Atlassian Jira and Confluence and several internal corporate user portals using LDAP and Oauth2 and 2FA from DUO.",
        "range":"January 2017-June 2017",
        "stack": [
            "IBM CLoud",
            "Python",
            "LDAP",
            "Oauth2",
            "XEN",
            "SSO",
            "3D virtual riality",
            "Nomad",
            "PostgreSQL",
            "JIRA",
            "Confluent"
        ]
    },
    {
        "role":"Senior DevOps",
        "branch": "entertainment, freelance  -  Paris, France",
        "company":"Skeegleapp",
        "summary":"I have created a proof of concept for live and on-demand streaming services. Infrastructure as a code for application build and deployment by AWS CloudFormation that manages private VPC and large sort of other AWS resources. I have built two components in this application. One was a media transformation system, that converts video files to acceptable streaming format and controls event processing with Kafka. The second was DRM (digital right management) content protection system into all components of the application. Event and inter- component communication were build with Kafka message broker. AWS RDS was used as a data store. CI/CD was built with Capistrano.",
        "range":"October 2014-October 2016",
        "stack": [
            "AWS",
            "SQS",
            "SNS",
            "S3",
            "VPC",
            "Cloudformation",
            "PHP",
            "python",
            "ffmpeg",
            "Wowsa",
            "copistrano",
            "mysql"
        ]
    },
    {
        "role":"DevOps",
        "branch": "freelance, remote",
        "company":"Upwork - Odesk",
        "summary":"I have completed over 100 projects for fife years. Most of the project was related to creating a proof of concept and security hole detection and hardening different information systems. The same project was codding job around automation process and delivery configuration or data or infrastructure. The same project was related to the video streaming system and Content delivery network, same project related to cryptography and Digital right management.",
        "range":"January 2011 - October 2016",
        "stack": [
            "chef",
            "ansible",
            "Docker",
            "AWS",
            "ECS",
            "PKI infrastructure",
            "Wowsa",
            "Mongo",
            "Kasandra",
            "PostgreSQL",
            "Mysql"
        ]
    },
    {
        "role":"IT Regional Project Manager, Team Lead",
        "branch": "finance, permanent contract  -  Kyjiw Ukraine",
        "company":"Alfa-Bank JSC",
        "summary":"I have managed 40 IT projects to create new banks' regional branches. Each project expected from me planing new IT infrastructure, delivery, and installation of all IT staff, and organization work experience for all corporate users in regional branches. I was leading a team of experts who make this work directly at branches. And I have a deep impact to create support and help desk teams. In Parallel I have transformed corporate software delivery and usage from bare metal on dedicated run-time to virtual terminal desktop experience.",
        "range":"June 2007- December 2010",
        "stack": [
            "MS RDP",
            "JIRA",
            "Confluen",
            "VMware Vsphere",
            "MPLS",
            "Java",
            "Oracle"
        ]
    },
    {
        "role":"IT support manager",
        "branch": "finance, permanent contract  -  Kyjiw Ukraine",
        "company":"Alfa-Bank JSC",
        "summary":"I have managed all IT processes at a big corporate office over 30000 m2 from the initial building construction phase till organization work experience and support help desk team for all 5000 users. I made a deep impact on creating a new data center inside this corporate office. I have cowered all questions and communication with external suppliers for networks, server room building for 150 racks, power and cooling supply for 150kWt. I have created a new Help-desk structure as a Level 1 support line at the company IT support system.",
        "range":"February 2005-June 2007",
        "stack": [
            "VMware Vsphere",
            "Cisco Network",
            "Windows Server",
            "MS AD",
            "MS SSO",
            "MS RDP",
            "ITIL"
        ]
    },
    {
        "role":"Sales manager",
        "branch": "System Integrator, permanent contract  -  Kyjiw Ukraine",
        "company":"BestPower GmbH",
        "summary":"I have managed sales and projects with uninterrupted power supply for various customers. I have completed the same large project for telecommunication and financial and government fields. In my project, I have resolved the problem of my customer with nonstable electric supply, control, and monitoring management electric power supply. Also, I have managed projects for integrated monitoring solutions of hardware like Diesel Power generators and power supply with modern monitoring systems like Nagios and Zabbix.",
        "range":"September 2004-February 2005",
        "stack": [
            "Nagios",
            "Zabix"

        ]
    },
    {
        "role":"Support engineer",
        "branch": "telecom, permanent contract  -  Kyjiw Ukraine",
        "company":"Priocom GmbH",
        "summary":"I work as a member of the support team that serves all issues around fiber optic data telecommunication network and voice delivery network. Level 1 and 2 support. I have played a major role in incident management.",
        "range":"Jule 2003-September 2004",
        "stack": [
            "Cisco network",
            "Linux Debian",
            "h323",
            "VoIP",
            "freeBSD",
            "ATS NEC",
            "ATS Siemens",
            "Nagios",
            "Zabix",
            "ITIL",
            "Incident management"

        ]
    },
    {
        "role":"System administrator, System Integrator",
        "branch": "telecom, permanent contract  -  Kyjiw Ukraine",
        "company":"NTT Energy GmbH",
        "summary":"I have managed IT support processes and issue for all IT staff in office and make support with integration monitoring system based o  SNMP at uninterrupted power supply project. IT infrastructure got several modernization and relocation. Core system, based on Windows Server with AD AD support mail system based on posfix and cube mail. Integration project mostly was based on zabbix an nagios monitoring solution.",
        "range":"Jul 2001- August 2004",
        "stack": [
            "Windows Server",
            "FreeBSD",
            "Zabix",
            "Nagios",
            "Bash",
            "Python"
        ]
    },
    {
        "role":"Junior Software Developer",
        "branch": "Energie, permanent contract  -  Kyjiw Ukraine",
        "company":"Ministry of Energy of Ukraine, IT-Center",
        "summary":"I have participated in the creation of a computer system for accounting for electricity use. I am responsible for the implementation of the interface for receiving energy utilization messages from users over FTP and HTTP. I have implemented an HTTP server with Apache HTTPD with PHP3 module and Oracle DB as a Datastore, and schedule processing system that writes in PERL and parses messages that uploaded to FTPD server.",
        "range":"Mart 1998 - June 2001",
        "stack": [
            "Linux Debian",
            "Oracle",
            "FreeBSD",
            "perl",
            "PHP",
            "Interbase",
            "Informix",
            "JavaScript",
            "IBM AIX",
            "HP-UX",
            "Cisco network"
        ]
    }
]
